Revit 2027 API
ACADExportOptions.ExportingAreas Property
 True to export area and room geometry, false otherwise. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportingAreas { get; set; }
Public Property ExportingAreas As Boolean
	Get
	Set
public:
property bool ExportingAreas {
	bool get ();
	void set (bool value);
}
member ExportingAreas : bool with get, set
Property Value
Boolean
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace